Ran Apply for project: `stage` dir: `terragrunt/stage` workspace: `default`

<details><summary>Show Output</summary>

```diff
In Terraform Apply

aws_instance.demo_instance: Refreshing state... [id=i-0fb538de775b89134]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.demo_instance has been deleted
  - resource "aws_instance" "demo_instance" {
        id                                   = "i-0fb538de775b89134"
      - public_ip                            = "52.66.73.149" -> null
        tags                                 = {
            "Name" = "my_ec2_stage_demo"
        }
        # (30 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.demo_instance will be created
  + resource "aws_instance" "demo_instance" {
      + ami                                  = "ami-0a0f1259dd1c90938"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "ap-south-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "my_ec2_stage_demo"
        }
      + tags_all                             = {
          + "Name" = "my_ec2_stage_demo"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ public_IP = "52.66.73.149" -> (known after apply)
aws_instance.demo_instance: Creating...
aws_instance.demo_instance: Still creating... [10s elapsed]
aws_instance.demo_instance: Still creating... [20s elapsed]
aws_instance.demo_instance: Still creating... [30s elapsed]
aws_instance.demo_instance: Creation complete after 31s [id=i-0c3b62431b5b6601b]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

public_IP = "13.201.122.113"
```

</details>